VersionGuid Property
 Get the element version Guid.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  Since:  2021
 Syntax
  C#
public Guid VersionGuid { get; }
  Visual Basic
Public ReadOnly Property VersionGuid As Guid
	Get
  Visual C++
public:
property Guid VersionGuid {
	Guid get ();
}
 Remarks
 If element version Guid is the same for a certain element in two instances of the saved file then we guarantee that the two elements are identical. One element version covers a period of time that is larger than a single transaction: it is a period between two saves, synchronize to central and reload latest. Thus, in an opened document in-between saves or synchronize actions, this version cannot be used to determine if any particular element has changed. To watch for element changes happening in-session, use event  [!:Autodesk::Revit::ApplicationServices::Application::DocumentChanged]  .
 See Also
  Element Class
  Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →